apojomovsky/epic-hal/pic18f6520-hal/include/pic18f6520_sfr.h
/*
 * SFR map, foundation subset: every address/mask/reset 1-to-1 from
 * DS39609B (PIC18F6520/6620/8520/8620 family), cross-checked against
 * the DFP proc header pic18f6520.h and the EDC PIC18F6520.PIC. The
 * generator (scripts/gen-sfr.py) projects the PIC_REG_* addresses; the
 * bit names and POR values are hand-maintained from the datasheet.
 */

#ifndef PIC18F6520_SFR_H
#define PIC18F6520_SFR_H

#include "pic18f6520_hal.h"

/* Access Bank SFR addresses. */
/* DS39609B Table 4-2/-3, SFR Map. All in the Access Bank (0xF60-0xFFF). */

/* Core CPU status, DS39609B Register 4-2/4-4. */
#define PIC_REG_STATUS        0xFD8U   /**< ALU status (N/OV/Z/DC/C).       */
#define PIC_REG_BSR           0xFE0U   /**< Bank Select Register (low nibble). */
#define PIC_REG_RCON          0xFD0U   /**< Reset Control (IPEN/RI/TO/PD/POR/BOR). */

/* I/O ports, DS39609B §10.0, Table 4-3. PORTx is the pin input sample;
 * LATx is the output latch; TRISx is the direction register. 64-pin
 * part: full PORTA-G, every port with LAT/TRIS (unlike the 28-pin 2520;
 * RE3 is MCLR-but-readable on this part, DS39609B Table 1-1). */
#define PIC_REG_PORTA         0xF80U
#define PIC_REG_PORTB         0xF81U
#define PIC_REG_PORTC         0xF82U
#define PIC_REG_PORTD         0xF83U
#define PIC_REG_PORTE         0xF84U
#define PIC_REG_PORTF         0xF85U
#define PIC_REG_PORTG         0xF86U

#define PIC_REG_LATA          0xF89U
#define PIC_REG_LATB          0xF8AU
#define PIC_REG_LATC          0xF8BU
#define PIC_REG_LATD          0xF8CU
#define PIC_REG_LATE          0xF8DU
#define PIC_REG_LATF          0xF8EU
#define PIC_REG_LATG          0xF8FU

#define PIC_REG_TRISA         0xF92U
#define PIC_REG_TRISB         0xF93U
#define PIC_REG_TRISC         0xF94U
#define PIC_REG_TRISD         0xF95U
#define PIC_REG_TRISE         0xF96U
#define PIC_REG_TRISF         0xF97U
#define PIC_REG_TRISG         0xF98U

/* Interrupt control, DS39609B §9.0, Register 9-1/9-2/9-3. */
#define PIC_REG_INTCON        0xFF2U   /**< GIE/GIEL/TMR0IE/INT0IE/RBIE + flags. */
#define PIC_REG_INTCON2       0xFF1U   /**< Pull-ups, INT edges, TMR0IP, INT3IP, RBIP. */
#define PIC_REG_INTCON3       0xFF0U   /**< INT1/INT2/INT3 enable, flag, priority. */

/* Peripheral interrupt flag/enable/priority, DS39609B Register 9-5..9-10. */
#define PIC_REG_PIR1          0xF9EU   /**< Peripheral Interrupt Flag Register 1. */
#define PIC_REG_PIE1          0xF9DU   /**< Peripheral Interrupt Enable Reg 1.    */
#define PIC_REG_IPR1          0xF9FU   /**< Peripheral Interrupt Priority Reg 1.  */
#define PIC_REG_PIR2          0xFA1U   /**< Flag Register 2 (TMR3IF...CMIF).      */
#define PIC_REG_PIE2          0xFA0U   /**< Enable Register 2.                     */
#define PIC_REG_IPR2          0xFA2U   /**< Priority Register 2.                   */
#define PIC_REG_PIR3          0xFA4U   /**< Flag Register 3 (CCP3-5, TMR4, USART2).*/
#define PIC_REG_PIE3          0xFA3U   /**< Enable Register 3.                     */
#define PIC_REG_IPR3          0xFA5U   /**< Priority Register 3.                   */

/* Timer0, DS39609B §11.0, Register 11-1. */
#define PIC_REG_T0CON         0xFD5U   /**< Timer0 control (on/8-16bit/src/edge/PSA/PS). */
#define PIC_REG_TMR0L         0xFD6U   /**< Timer0 low byte (also 8-bit mode value). */
#define PIC_REG_TMR0H         0xFD7U   /**< Timer0 high byte (16-bit mode only).    */

/* Oscillator / watchdog control, DS39609B §23.0 (Register 23-3 OSCCON,
 * Register 23-15 WDTCON). */
#define PIC_REG_OSCCON        0xFD3U   /**< Oscillator control (SCS, clock switch).  */
#define PIC_REG_WDTCON        0xFD1U   /**< WDT control (SWDTEN, software enable).   */

/* Timer1, DS39609B §12.0, Register 12-1 (T1CON 0xFCD, same shape as 4550). */
#define PIC_REG_T1CON         0xFCDU   /**< Timer1 control (RD16/run/prescale/osc/sync/cs/on). */
#define PIC_REG_TMR1L         0xFCEU   /**< Timer1 low byte.                          */
#define PIC_REG_TMR1H         0xFCFU   /**< Timer1 high byte.                         */

/* Timer2, DS39609B §13.0, Register 13-1 (T2CON 0xFCA, same shape as 4550). */
#define PIC_REG_T2CON         0xFCAU   /**< Timer2 control (postscaler/on/prescaler). */
#define PIC_REG_PR2           0xFCBU   /**< Timer2 period register (Access Bank).    */
#define PIC_REG_TMR2          0xFCCU   /**< Timer2 counter.                          */

/* Timer3, DS39609B §14.0, Register 14-1 (T3CON 0xFB1, same shape as 4550). */
#define PIC_REG_T3CON         0xFB1U   /**< Timer3 control (RD16/CCP-sel/prescale/sync/cs/on). */
#define PIC_REG_TMR3L         0xFB2U   /**< Timer3 low byte.                          */
#define PIC_REG_TMR3H         0xFB3U   /**< Timer3 high byte.                         */

/* Timer4, DS39609B §15.0, Register 15-1 (T4CON 0xF76, same shape as T2CON). */
#define PIC_REG_T4CON         0xF76U   /**< Timer4 control (postscaler/on/prescaler). */
#define PIC_REG_PR4           0xF77U   /**< Timer4 period register.                 */
#define PIC_REG_TMR4          0xF78U   /**< Timer4 counter.                          */

/* CCP1-5, DS39609B §16.0. All five are plain CCP modules (no ECCP
 * auto-shutdown/PWM-mode registers: confirmed absent from the DFP
 * header, no PSTRCON/ECCPAS on this part). Register 16-1 covers the
 * CCPxCON layout, identical across instances (DS39609B §16.0
 * "Bit assignments ... identical for all five modules"). */
#define PIC_REG_CCP1CON       0xFBDU   /**< CCP1 control (mode + duty LSBs).   */
#define PIC_REG_CCPR1L        0xFBEU   /**< CCP1 low byte.                     */
#define PIC_REG_CCPR1H        0xFBFU   /**< CCP1 high byte.                    */
#define PIC_REG_CCP2CON       0xFBAU   /**< CCP2 control (mode + duty LSBs).    */
#define PIC_REG_CCPR2L        0xFBBU   /**< CCP2 low byte.                      */
#define PIC_REG_CCPR2H        0xFBCU   /**< CCP2 high byte.                     */
#define PIC_REG_CCP3CON       0xFB7U   /**< CCP3 control (mode + duty LSBs).    */
#define PIC_REG_CCPR3L        0xFB8U   /**< CCP3 low byte.                      */
#define PIC_REG_CCPR3H        0xFB9U   /**< CCP3 high byte.                     */
#define PIC_REG_CCP4CON       0xF73U   /**< CCP4 control (mode + duty LSBs).    */
#define PIC_REG_CCPR4L        0xF74U   /**< CCP4 low byte.                      */
#define PIC_REG_CCPR4H        0xF75U   /**< CCP4 high byte.                     */
#define PIC_REG_CCP5CON       0xF70U   /**< CCP5 control (mode + duty LSBs).    */
#define PIC_REG_CCPR5L        0xF71U   /**< CCP5 low byte.                      */
#define PIC_REG_CCPR5H        0xF72U   /**< CCP5 high byte.                     */

