apojomovsky/epic-hal/pic18f6520-hal/include/pic18f6520_sfr.h
/* MSSP, DS39609B §17.0 (SSPCON1 0xFC6, same shape as 4550). */
#define PIC_REG_SSPCON2       0xFC5U   /**< MSSP control 2 (I2C master: SEN/PEN/etc). */
#define PIC_REG_SSPCON1       0xFC6U   /**< MSSP control 1 (mode/SSPEN/CKP/WCOL/SSPOV).*/
#define PIC_REG_SSPSTAT       0xFC7U   /**< MSSP status (SMP/CKE/D-A/P/S/R-W/UA/BF).  */
#define PIC_REG_SSPADD        0xFC8U   /**< MSSP address (I2C slave) / baud (master). */
#define PIC_REG_SSPBUF        0xFC9U   /**< MSSP data buffer.                          */

/* EUSART1, DS39609B §18.0 (Register 18-1/18-2/18-3). No BAUDCON on
 * this part and no SPBRGH: the baud generator is 8-bit only
 * (confirmed absent from the DFP header). */
#define PIC_REG_RCSTA1        0xFABU   /**< EUSART1 receive control/status.   */
#define PIC_REG_TXSTA1        0xFACU   /**< EUSART1 transmit control/status.  */
#define PIC_REG_TXREG1        0xFADU   /**< EUSART1 transmit data.            */
#define PIC_REG_RCREG1        0xFAEU   /**< EUSART1 receive data.             */
#define PIC_REG_SPBRG1        0xFAFU   /**< EUSART1 baud-rate divisor.        */

/* EUSART2, DS39609B §18.0 (same register shape as EUSART1). */
#define PIC_REG_RCSTA2        0xF6BU   /**< EUSART2 receive control/status.   */
#define PIC_REG_TXSTA2        0xF6CU   /**< EUSART2 transmit control/status.  */
#define PIC_REG_TXREG2        0xF6DU   /**< EUSART2 transmit data.            */
#define PIC_REG_RCREG2        0xF6EU   /**< EUSART2 receive data.             */
#define PIC_REG_SPBRG2        0xF6FU   /**< EUSART2 baud-rate divisor.        */

/* Parallel Slave Port, DS39609B §10.10, Register 10-10 (PSPCON 0xFB0). */
#define PIC_REG_PSPCON        0xFB0U   /**< PSP control/status.               */

/* Comparator, DS39609B §20.0 (two comparators, Register 20-1). */
#define PIC_REG_CMCON         0xFB4U   /**< Comparator control (mode/inputs/outputs). */
#define PIC_REG_CVRCON        0xFB5U   /**< Comparator voltage reference control.     */

/* Data EEPROM, DS39609B §7.0 (1024 bytes, EEADR + EEADRH, same as 4550). */
#define PIC_REG_EECON1        0xFA6U   /**< EEPROM/Flash control (RD/WR/WREN/WRERR/EEPGD). */
#define PIC_REG_EECON2        0xFA7U   /**< EEPROM unlock (write 0x55 then 0xAA).       */
#define PIC_REG_EEDATA        0xFA8U   /**< EEPROM data register.                      */
#define PIC_REG_EEADR         0xFA9U   /**< EEPROM address register (low byte).        */
#define PIC_REG_EEADRH        0xFAAU   /**< EEPROM address register (high byte).       */

/* A/D Converter, DS39609B §19.0 (10-bit, 12 channels AN0-AN11). */
#define PIC_REG_ADCON2        0xFC0U   /**< A/D control 2 (ADCS/ADFM).                 */
#define PIC_REG_ADCON1        0xFC1U   /**< A/D control 1 (PCFG/VCFG).                 */
#define PIC_REG_ADCON0        0xFC2U   /**< A/D control 0 (CHS/GO-DONE/ADON).          */
#define PIC_REG_ADRESL        0xFC3U   /**< A/D result low byte.                       */
#define PIC_REG_ADRESH        0xFC4U   /**< A/D result high byte.                       */

/* Low-Voltage Detect, DS39609B §22.0, Register 22-1 (LVDCON 0xFD2). */
#define PIC_REG_LVDCON        0xFD2U   /**< LVD control (LVDL/LVDEN/IRVST).            */

/* STATUS bits (Register 4-2). */
#define PIC_STATUS_N          EPIC_BIT(4)   /**< Negative / borrow complement. */
#define PIC_STATUS_OV         EPIC_BIT(3)   /**< Overflow.                     */
#define PIC_STATUS_Z          EPIC_BIT(2)   /**< Zero.                         */
#define PIC_STATUS_DC         EPIC_BIT(1)   /**< Digit carry/borrow.           */
#define PIC_STATUS_C          EPIC_BIT(0)   /**< Carry/borrow.                 */

/* RCON bits (Register 4-4). No SBOREN bit on this part (4550 has it,
 * 6520 does not; DS39609B Register 4-4). */
#define PIC_RCON_IPEN         EPIC_BIT(7)   /**< Interrupt Priority Enable.    */
#define PIC_RCON_RI           EPIC_BIT(4)   /**< RESET instruction flag.       */
#define PIC_RCON_TO           EPIC_BIT(3)   /**< WDT time-out flag (1=not).    */
#define PIC_RCON_PD           EPIC_BIT(2)   /**< Power-down (Sleep) flag (1=not). */
#define PIC_RCON_POR          EPIC_BIT(1)   /**< Power-on Reset status.        */
#define PIC_RCON_BOR          EPIC_BIT(0)   /**< Brown-out Reset status.       */

/* INTCON bits (Register 9-1). */
#define PIC_INTCON_GIE        EPIC_BIT(7)   /**< Global Int Enable / high-priority GIE. */
#define PIC_INTCON_GIEH       PIC_INTCON_GIE
#define PIC_INTCON_PEIE       EPIC_BIT(6)   /**< Peripheral Int Enable / low-priority GIEL. */
#define PIC_INTCON_GIEL       PIC_INTCON_PEIE
#define PIC_INTCON_TMR0IE     EPIC_BIT(5)   /**< Timer0 overflow interrupt enable. */
#define PIC_INTCON_INT0IE     EPIC_BIT(4)   /**< INT0 external interrupt enable.   */
#define PIC_INTCON_RBIE       EPIC_BIT(3)   /**< RB<7:4> change interrupt enable.  */
#define PIC_INTCON_TMR0IF     EPIC_BIT(2)   /**< Timer0 overflow interrupt flag.   */
#define PIC_INTCON_INT0IF     EPIC_BIT(1)   /**< INT0 external interrupt flag.     */
#define PIC_INTCON_RBIF       EPIC_BIT(0)   /**< RB<7:4> change interrupt flag.    */

/* INTCON2 bits (Register 9-2). INT3 priority lives here (bit 1), the
 * INT3 edge in bit 3; the 4550 family has no INT3 sources for these. */
#define PIC_INTCON2_RBPU      EPIC_BIT(7)   /**< PORTB pull-up enable (active-low). */
#define PIC_INTCON2_INTEDG0   EPIC_BIT(6)   /**< INT0 edge select (1=rising).       */
#define PIC_INTCON2_INTEDG1   EPIC_BIT(5)   /**< INT1 edge select.                  */
#define PIC_INTCON2_INTEDG2   EPIC_BIT(4)   /**< INT2 edge select.                  */
#define PIC_INTCON2_INTEDG3   EPIC_BIT(3)   /**< INT3 edge select.                 */
#define PIC_INTCON2_TMR0IP    EPIC_BIT(2)   /**< Timer0 overflow priority (1=high). */
#define PIC_INTCON2_INT3IP    EPIC_BIT(1)   /**< INT3 priority (1=high).           */
#define PIC_INTCON2_RBIP      EPIC_BIT(0)   /**< RB change priority (1=high).      */

/* INTCON3 bits (Register 9-3). */
#define PIC_INTCON3_INT2IP    EPIC_BIT(7)   /**< INT2 priority (1=high).            */
#define PIC_INTCON3_INT1IP    EPIC_BIT(6)   /**< INT1 priority (1=high).            */
#define PIC_INTCON3_INT3IE    EPIC_BIT(5)   /**< INT3 external interrupt enable.    */
#define PIC_INTCON3_INT2IE    EPIC_BIT(4)   /**< INT2 external interrupt enable.    */
#define PIC_INTCON3_INT1IE    EPIC_BIT(3)   /**< INT1 external interrupt enable.    */
#define PIC_INTCON3_INT3IF    EPIC_BIT(2)   /**< INT3 external interrupt flag.      */
#define PIC_INTCON3_INT2IF    EPIC_BIT(1)   /**< INT2 external interrupt flag.      */
#define PIC_INTCON3_INT1IF    EPIC_BIT(0)   /**< INT1 external interrupt flag.     */

/* PIR1 / PIE1 / IPR1 bits (Register 9-5/9-7/9-9). Same layout as 4550,
 * plus PSPIF (this part has the Parallel Slave Port). */
#define PIC_PIR1_PSPIF        EPIC_BIT(7)   /**< PSP flag.                      */
#define PIC_PIR1_ADIF         EPIC_BIT(6)   /**< A/D conversion complete flag.  */
#define PIC_PIR1_RCIF         EPIC_BIT(5)   /**< EUSART1 receive flag.          */
#define PIC_PIR1_TXIF         EPIC_BIT(4)   /**< EUSART1 transmit flag.         */
#define PIC_PIR1_SSPIF        EPIC_BIT(3)   /**< MSSP flag.                     */
#define PIC_PIR1_CCP1IF       EPIC_BIT(2)   /**< CCP1 flag.                     */
#define PIC_PIR1_TMR2IF       EPIC_BIT(1)   /**< Timer2 match flag.             */
#define PIC_PIR1_TMR1IF       EPIC_BIT(0)   /**< Timer1 overflow flag.          */
#define PIC_PIE1_PSPIE        EPIC_BIT(7)
#define PIC_PIE1_ADIE         EPIC_BIT(6)
#define PIC_PIE1_RCIE         EPIC_BIT(5)
#define PIC_PIE1_TXIE         EPIC_BIT(4)
#define PIC_PIE1_SSPIE        EPIC_BIT(3)
#define PIC_PIE1_CCP1IE       EPIC_BIT(2)
#define PIC_PIE1_TMR2IE       EPIC_BIT(1)
#define PIC_PIE1_TMR1IE       EPIC_BIT(0)
#define PIC_IPR1_PSPIP        EPIC_BIT(7)
#define PIC_IPR1_ADIP         EPIC_BIT(6)
#define PIC_IPR1_RCIP         EPIC_BIT(5)
#define PIC_IPR1_TXIP         EPIC_BIT(4)
#define PIC_IPR1_SSPIP        EPIC_BIT(3)
#define PIC_IPR1_CCP1IP       EPIC_BIT(2)
#define PIC_IPR1_TMR2IP       EPIC_BIT(1)
#define PIC_IPR1_TMR1IP       EPIC_BIT(0)

/* PIR2 / PIE2 / IPR2 bits (Register 9-6/9-8/9-10). No USBIF/OSCFIF on
 * this part: CMIF is bit 6, no bit 7 (DS39609B Register 9-6). */
#define PIC_PIR2_CMIF         EPIC_BIT(6)   /**< Comparator change flag.        */
#define PIC_PIR2_EEIF         EPIC_BIT(4)   /**< EEPROM write done flag.        */
#define PIC_PIR2_BCLIF        EPIC_BIT(3)   /**< MSSP bus collision flag.       */
#define PIC_PIR2_LVDIF        EPIC_BIT(2)   /**< Low-voltage detect flag.       */
#define PIC_PIR2_TMR3IF       EPIC_BIT(1)   /**< Timer3 overflow flag.           */
#define PIC_PIR2_CCP2IF       EPIC_BIT(0)   /**< CCP2 flag.                     */
#define PIC_PIE2_CMIE         EPIC_BIT(6)
#define PIC_PIE2_EEIE         EPIC_BIT(4)
#define PIC_PIE2_BCLIE        EPIC_BIT(3)
#define PIC_PIE2_LVDIE        EPIC_BIT(2)
#define PIC_PIE2_TMR3IE       EPIC_BIT(1)
#define PIC_PIE2_CCP2IE       EPIC_BIT(0)
#define PIC_IPR2_CMIP         EPIC_BIT(6)
#define PIC_IPR2_EEIP         EPIC_BIT(4)
#define PIC_IPR2_BCLIP        EPIC_BIT(3)
#define PIC_IPR2_LVDIP        EPIC_BIT(2)
#define PIC_IPR2_TMR3IP       EPIC_BIT(1)
#define PIC_IPR2_CCP2IP       EPIC_BIT(0)

/* PIR3 / PIE3 / IPR3 bits (Register 9-6/9-8/9-10). This part's extra
 * sources beyond the 4550 family: CCP3-5, TMR4, EUSART2. */
#define PIC_PIR3_RC2IF        EPIC_BIT(5)   /**< EUSART2 receive flag.          */
#define PIC_PIR3_TX2IF        EPIC_BIT(4)   /**< EUSART2 transmit flag.         */
#define PIC_PIR3_TMR4IF       EPIC_BIT(3)   /**< Timer4 match flag.             */
#define PIC_PIR3_CCP5IF       EPIC_BIT(2)   /**< CCP5 flag.                     */
#define PIC_PIR3_CCP4IF       EPIC_BIT(1)   /**< CCP4 flag.                     */
#define PIC_PIR3_CCP3IF       EPIC_BIT(0)   /**< CCP3 flag.                     */
#define PIC_PIE3_RC2IE        EPIC_BIT(5)
#define PIC_PIE3_TX2IE        EPIC_BIT(4)
#define PIC_PIE3_TMR4IE       EPIC_BIT(3)
#define PIC_PIE3_CCP5IE       EPIC_BIT(2)
#define PIC_PIE3_CCP4IE       EPIC_BIT(1)
#define PIC_PIE3_CCP3IE       EPIC_BIT(0)
#define PIC_IPR3_RC2IP        EPIC_BIT(5)
#define PIC_IPR3_TX2IP        EPIC_BIT(4)
#define PIC_IPR3_TMR4IP       EPIC_BIT(3)
#define PIC_IPR3_CCP5IP       EPIC_BIT(2)
#define PIC_IPR3_CCP4IP       EPIC_BIT(1)
#define PIC_IPR3_CCP3IP       EPIC_BIT(0)

/* T0CON bits (Register 11-1). */
#define PIC_T0CON_TMR0ON      EPIC_BIT(7)   /**< Timer0 on/off.                  */
#define PIC_T0CON_T08BIT      EPIC_BIT(6)   /**< 1=8-bit, 0=16-bit mode.         */
#define PIC_T0CON_T0CS        EPIC_BIT(5)   /**< 0=internal Fosc/4, 1=T0CKI pin. */
#define PIC_T0CON_T0SE        EPIC_BIT(4)   /**< Counter mode edge select.       */
#define PIC_T0CON_PSA         EPIC_BIT(3)   /**< 0=prescaler assigned, 1=not.    */
#define PIC_T0CON_T0PS_MASK   0x07U         /**< T0PS2:T0PS0, prescaler ratio.   */

