apojomovsky/epic-hal/pic18f6520-hal/include/pic18f6520_sfr.h
/* T1CON bits (Register 12-1). Bit 6 is unimplemented on this part
 * (no T1RUN; DS39609B Register 12-1), unlike the 4550/2520 families. */
#define PIC_T1CON_RD16        EPIC_BIT(7)   /**< 16-bit read/write mode enable.   */
#define PIC_T1CON_T1CKPS_MASK 0x30U         /**< T1CKPS1:T1CKPS0 at bits 5:4.     */
#define PIC_T1CON_T1OSCEN     EPIC_BIT(3)   /**< Timer1 oscillator enable.       */
#define PIC_T1CON_T1SYNC      EPIC_BIT(2)   /**< External clock sync (1=async).  */
#define PIC_T1CON_TMR1CS      EPIC_BIT(1)   /**< 0=Fosc/4, 1=external/T1OSC.     */
#define PIC_T1CON_TMR1ON      EPIC_BIT(0)   /**< Timer1 on/off.                   */
#define PIC_T1CON_POR_VALUE   0x00U         /**< Power-on reset value.            */

/* T2CON bits (Register 13-1, identical to 4550). */
#define PIC_T2CON_TOUTPS_MASK 0x78U         /**< T2OUTPS3:T2OUTPS0 at bits 6:3 (1:(N+1)). */
#define PIC_T2CON_TMR2ON      EPIC_BIT(2)   /**< Timer2 on/off.                   */
#define PIC_T2CON_T2CKPS_MASK 0x03U         /**< T2CKPS1:T2CKPS0 at bits 1:0.     */
#define PIC_T2CON_POR_VALUE   0x00U         /**< Power-on reset value.            */
#define PIC_PR2_POR_VALUE     0xFFU         /**< PR2 power-on reset value.        */

/* T3CON bits (Register 14-1, identical to 4550). */
#define PIC_T3CON_T3CCP1      EPIC_BIT(3)   /**< CCP1 Timer1/Timer3 select.       */
#define PIC_T3CON_RD16        EPIC_BIT(7)   /**< 16-bit read/write mode enable.   */
#define PIC_T3CON_T3CCP2      EPIC_BIT(6)   /**< CCP2 Timer1/Timer3 select.       */
#define PIC_T3CON_T3CKPS_MASK 0x30U         /**< T3CKPS1:T3CKPS0 at bits 5:4.     */
#define PIC_T3CON_T3SYNC      EPIC_BIT(2)   /**< External clock sync (alias).     */
#define PIC_T3CON_TMR3CS      EPIC_BIT(1)   /**< 0=Fosc/4, 1=external.            */
#define PIC_T3CON_TMR3ON      EPIC_BIT(0)   /**< Timer3 on/off.                   */
#define PIC_T3CON_POR_VALUE   0x00U         /**< Power-on reset value.            */

/* T4CON bits (Register 15-1, same shape as T2CON: 4-bit postscaler
 * at bits 6:3, 2-bit prescaler at bits 1:0). */
#define PIC_T4CON_TOUTPS_MASK 0x78U         /**< T4OUTPS3:T4OUTPS0 at bits 6:3 (1:(N+1)). */
#define PIC_T4CON_TMR4ON      EPIC_BIT(2)   /**< Timer4 on/off.                   */
#define PIC_T4CON_T4CKPS_MASK 0x03U         /**< T4CKPS1:T4CKPS0 at bits 1:0.     */
#define PIC_T4CON_POR_VALUE   0x00U         /**< Power-on reset value.            */
#define PIC_PR4_POR_VALUE     0xFFU         /**< PR4 power-on reset value.        */

/* CCPxCON bits (Register 16-1, identical across CCP1-5). All five are
 * plain CCP modules on this part: no P1M/DCxB-only-ECCP extras. */
#define PIC_CCPxCON_CCPxM_MASK 0x0FU        /**< CCPxM3:CCPxM0 mode bits.        */
#define PIC_CCPxCON_DCxB_MASK  0x30U        /**< DCxB1:DCxB0 duty LSBs (bits 5:4). */
#define PIC_CCPxCON_POR_VALUE  0x00U        /**< Power-on reset value.           */

/* MSSP bits (Register 17-1/17-2/17-3, same as 4550). */
#define PIC_SSPCON1_SSPM_MASK  0x0FU       /**< SSPM3:SSPM0 at bits 3:0 (mode select). */
#define PIC_SSPCON1_CKP        EPIC_BIT(4)  /**< Clock polarity (SPI).                */
#define PIC_SSPCON1_SSPEN      EPIC_BIT(5)  /**< MSSP enable.                          */
#define PIC_SSPCON1_SSPOV      EPIC_BIT(6)  /**< Receive overflow.                    */
#define PIC_SSPCON1_WCOL       EPIC_BIT(7)  /**< Write collision.                     */
#define PIC_SSPCON1_POR_VALUE  0x00U        /**< Power-on reset value.                */
#define PIC_SSPCON2_SEN        EPIC_BIT(0)  /**< Start condition enable (I2C master). */
#define PIC_SSPCON2_RSEN       EPIC_BIT(1)  /**< Repeated start enable.               */
#define PIC_SSPCON2_PEN        EPIC_BIT(2)  /**< Stop condition enable.               */
#define PIC_SSPCON2_RCEN       EPIC_BIT(3)  /**< Receive enable.                      */
#define PIC_SSPCON2_ACKEN      EPIC_BIT(4)  /**< Acknowledge sequence enable.         */
#define PIC_SSPCON2_ACKDT      EPIC_BIT(5)  /**< Acknowledge data (ACK/NACK value).    */
#define PIC_SSPCON2_ACKSTAT    EPIC_BIT(6)  /**< Acknowledge status (from slave).      */
#define PIC_SSPCON2_GCEN       EPIC_BIT(7)  /**< General call enable (I2C slave).      */
#define PIC_SSPSTAT_BF         EPIC_BIT(0)  /**< Buffer full.                          */
#define PIC_SSPSTAT_UA         EPIC_BIT(1)  /**< Update address (10-bit).              */
#define PIC_SSPSTAT_RW         EPIC_BIT(2)  /**< Read/write (I2C).                     */
#define PIC_SSPSTAT_S          EPIC_BIT(3)  /**< Start (I2C).                          */
#define PIC_SSPSTAT_P          EPIC_BIT(4)  /**< Stop (I2C).                           */
#define PIC_SSPSTAT_DA         EPIC_BIT(5)  /**< Data/address (I2C).                   */
#define PIC_SSPSTAT_CKE        EPIC_BIT(6)  /**< Clock edge (SPI).                     */
#define PIC_SSPSTAT_SMP        EPIC_BIT(7)  /**< Sample phase (SPI master).             */

/* EUSART1/2 bits (Register 18-1/18-2, same shape as 4550 minus
 * BAUDCON/SPBRGH). TXSTA1/2 share the layout; RX-9-bit data bit is
 * TXD8/RXD8 on this part (DS39609B Register 18-1). */
#define PIC_TXSTA_TX9D         EPIC_BIT(0)  /**< 9th bit of TX data.                  */
#define PIC_TXSTA_TRMT         EPIC_BIT(1)  /**< TSR empty (read-only).               */
#define PIC_TXSTA_BRGH         EPIC_BIT(2)  /**< High baud rate.                      */
#define PIC_TXSTA_SYNC         EPIC_BIT(4)  /**< Sync mode.                           */
#define PIC_TXSTA_TXEN         EPIC_BIT(5)  /**< TX enable.                           */
#define PIC_TXSTA_TX9          EPIC_BIT(6)  /**< 9-bit TX.                            */
#define PIC_TXSTA_CSRC         EPIC_BIT(7)  /**< Clock source (sync).                 */
#define PIC_RCSTA_RX9D         EPIC_BIT(0)  /**< 9th bit of RX data.                  */
#define PIC_RCSTA_OERR         EPIC_BIT(1)  /**< Overrun error.                       */
#define PIC_RCSTA_FERR         EPIC_BIT(2)  /**< Framing error.                       */
#define PIC_RCSTA_ADDEN        EPIC_BIT(3)  /**< Address detect (9-bit).              */
#define PIC_RCSTA_CREN         EPIC_BIT(4)  /**< Continuous receive.                  */
#define PIC_RCSTA_SREN         EPIC_BIT(5)  /**< Single receive.                      */
#define PIC_RCSTA_RX9          EPIC_BIT(6)  /**< 9-bit RX.                            */
#define PIC_RCSTA_SPEN         EPIC_BIT(7)  /**< Serial port enable.                  */
#define PIC_TXSTA_POR_VALUE    0x02U        /**< TXSTA POR (TRMT=1, TSR empty).   */
#define PIC_RCSTA_POR_VALUE    0x00U        /**< RCSTA power-on reset value.        */
#define PIC_SPBRG_POR_VALUE    0x00U        /**< SPBRG power-on reset value.        */

