apojomovsky/epic-hal/pic18f6520-hal/include/pic18f6520_sfr.h
/* PSP bits (Register 10-10, this part only among the PIC18 families
 * this repo carries; the 4550/2520/1320 have no PSP). */
#define PIC_PSPCON_PSPMODE     EPIC_BIT(4)  /**< PSP mode select.                   */
#define PIC_PSPCON_IBOV        EPIC_BIT(5)  /**< Input buffer overflow.              */
#define PIC_PSPCON_OBF         EPIC_BIT(6)  /**< Output buffer full.                 */
#define PIC_PSPCON_IBF         EPIC_BIT(7)  /**< Input buffer full.                  */
#define PIC_PSPCON_POR_VALUE   0x00U        /**< Power-on reset value.               */

/* ADC bits (Register 19-1/19-2/19-3). Same layout as 4550; CHS is a
 * 4-bit field (12 channels, AN0-AN11). */
#define PIC_ADCON0_ADON        EPIC_BIT(0)  /**< A/D module on.                       */
#define PIC_ADCON0_GO_DONE     EPIC_BIT(1)  /**< Conversion status (1 = in progress). */
#define PIC_ADCON0_CHS_MASK    0x3CU        /**< CHS3:CHS0 at bits 5:2.               */
#define PIC_ADCON0_CHS_POS     2            /**< CHS field shift.                     */
#define PIC_ADCON0_POR_VALUE   0x00U
#define PIC_ADCON1_PCFG_MASK   0x0FU        /**< PCFG3:PCFG0 at bits 3:0.             */
#define PIC_ADCON1_VCFG0       EPIC_BIT(4)  /**< Vref+ source: 1=AN2, 0=VDD.          */
#define PIC_ADCON1_VCFG1       EPIC_BIT(5)  /**< Vref- source: 1=AN3, 0=VSS.           */
#define PIC_ADCON1_POR_VALUE   0x00U
#define PIC_ADCON2_ADCS_MASK   0x07U        /**< ADCS2:ADCS0 at bits 2:0.             */
#define PIC_ADCON2_ADFM        EPIC_BIT(7)  /**< 1 = right justified, 0 = left.       */
#define PIC_ADCON2_POR_VALUE   0x00U

/* Comparator bits (Register 20-1). CM=111 is comparators off;
 * POR image is CM=000 (all comparators in Reset mode) on this part,
 * unlike the 4550 family's 0x07 (DS39609B Table 3-3 + Register 20-1). */
#define PIC_CMCON_CM_MASK      0x07U        /**< CM2:CM0 at bits 2:0 (mode select). */
#define PIC_CMCON_CIS          EPIC_BIT(3)  /**< Comparator input switch.            */
#define PIC_CMCON_C1INV        EPIC_BIT(4)  /**< C1 output inversion.                 */
#define PIC_CMCON_C2INV        EPIC_BIT(5)  /**< C2 output inversion.                 */
#define PIC_CMCON_C1OUT        EPIC_BIT(6)  /**< C1 output (read-only).              */
#define PIC_CMCON_C2OUT        EPIC_BIT(7)  /**< C2 output (read-only).              */
#define PIC_CMCON_POR_VALUE    0x00U        /**< POR: comparator Reset mode (CM=000). */

/* CVRCON bits (Register 21-1, same as 4550). */
#define PIC_CVRCON_CVR_MASK    0x0FU        /**< CVR3:CVR0 at bits 3:0.               */
#define PIC_CVRCON_CVRSS       EPIC_BIT(4)  /**< Source select (0=AVDD).              */
#define PIC_CVRCON_CVRR        EPIC_BIT(5)  /**< Range select (0=high).               */
#define PIC_CVRCON_CVROE       EPIC_BIT(6)  /**< Output enable to pin.                */
#define PIC_CVRCON_CVREN       EPIC_BIT(7)  /**< Reference enable.                    */
#define PIC_CVRCON_POR_VALUE   0x00U        /**< Power-on reset value.                */

/* LVD bits (Register 22-1). */
#define PIC_LVDCON_LVDL_MASK   0x0FU        /**< LVDL3:LVDL0 at bits 3:0 (Vtrip).     */
#define PIC_LVDCON_LVDEN       EPIC_BIT(4)  /**< LVD enable.                          */
#define PIC_LVDCON_IRVST       EPIC_BIT(5)  /**< Internal reference stable (RO).      */
#define PIC_LVDCON_POR_VALUE   0x05U        /**< POR image: LVDL=0101 (2.8 V, Table 26-8), LVD off. */

/* Data EEPROM bits (Register 7-1, same as 4550). */
#define PIC_EECON1_RD          EPIC_BIT(0)  /**< Read control (strobe, self-clears). */
#define PIC_EECON1_WR          EPIC_BIT(1)  /**< Write control (strobe).             */
#define PIC_EECON1_WREN        EPIC_BIT(2)  /**< Write enable.                       */
#define PIC_EECON1_WRERR       EPIC_BIT(3)  /**< Write-error flag.                   */
#define PIC_EECON1_FREE        EPIC_BIT(4)  /**< Flash row erase enable.             */
#define PIC_EECON1_CFGS        EPIC_BIT(6)  /**< Config access (1) vs code/data (0). */
#define PIC_EECON1_EEPGD       EPIC_BIT(7)  /**< 0 = data EEPROM, 1 = program flash. */
#define PIC_EECON1_POR_VALUE   0x00U

/* Reset values (POR), DS39609B Table 3-3 + Table 4-3. RCON POR image
 * 0x1C (IPEN=0, RI/TO/PD set, POR/BOR cleared: both "a reset occurred"
 * flags read 0 at power-on; DS39609B Table 3-2 row "Power-on Reset").
 * IPR1 to 0x7F, IPR2 to 0x5F, IPR3 to 0x3F (bits 6/4 of IPR2 and bits
 * 6-7 of IPR3 are unimplemented, Table 4-3). T0CON to 0xFF; INTCON2 to
 * 0xFF (all priority bits + RBPU set, incl. INT3); INTCON3 to 0xC0
 * (INT1/2 priority). */
#define PIC_STATUS_POR_VALUE     0x00U
#define PIC_BSR_POR_VALUE        0x00U
#define PIC_RCON_POR_VALUE       0x1CU
#define PIC_INTCON_POR_VALUE     0x00U
#define PIC_INTCON2_POR_VALUE    0xFFU
#define PIC_INTCON3_POR_VALUE    0xC0U
#define PIC_PIR1_POR_VALUE       0x00U
#define PIC_PIE1_POR_VALUE       0x00U
#define PIC_IPR1_POR_VALUE       0x7FU
#define PIC_PIR2_POR_VALUE       0x00U
#define PIC_PIE2_POR_VALUE       0x00U
#define PIC_IPR2_POR_VALUE       0x5FU
#define PIC_PIR3_POR_VALUE       0x00U
#define PIC_PIE3_POR_VALUE       0x00U
#define PIC_IPR3_POR_VALUE       0x3FU
#define PIC_T0CON_POR_VALUE      0xFFU
#define PIC_TRIS_POR_VALUE       0xFFU   /* All pins inputs after POR. */
#define PIC_LAT_POR_VALUE        0x00U   /* Output latches clear after POR. */
#define PIC_PORT_POR_VALUE       0x00U

#endif /* PIC18F6520_SFR_H */
